#创建一个列表
stus = ['孙悟空','猪八戒','沙和尚','唐僧','蜘蛛精','白骨精','蜘蛛精','蜘蛛精','蜘蛛精']

print("修改前:",stus)

#直接通过索引
stus[0] = 'sunwukong'
#通过del来删除元素

del stus[2]

print('修改后',stus)




#创建一个列表
stus = ['孙悟空','猪八戒','沙和尚','唐僧','蜘蛛精','白骨精']

print("修改前:",stus)

#通过切片来修改列表
#在给切片进行赋值时，只能使用序列
#stus[0:2] = ['niumow','红孩儿'] 使用新元素替换旧元素
#stus[0:2] = ['niumow','红孩儿',"erlangshen"]
#stus[0:0] = ['牛魔王']#向索引为0插入新元素

#当设置了步长，序列中元素的个数比必须和切片中元素的个数相等
#stus[::2]  = ['牛魔王','红孩儿','二郎神']


#通过切片来删除元素
#del stus[0:2]
#del stus[::2]

#stus[1:3] = []
#print("修改后",stus)


#以上操作，只适用可变序列

s = 'hello'
s =list(s);
print()